eerimoq/simba/make/arduino/esp/boards.txt
#
# @section License
#
# This is free and unencumbered software released into the public domain.
#
# Anyone is free to copy, modify, publish, use, compile, sell, or
# distribute this software, either in source code form or as a compiled
# binary, for any purpose, commercial or non-commercial, and by any
# means.
#
# In jurisdictions that recognize copyright laws, the author or authors
# of this software dedicate any and all copyright interest in the
# software to the public domain. We make this dedication for the benefit
# of the public at large and to the detriment of our heirs and
# successors. We intend this dedication to be an overt act of
# relinquishment in perpetuity of all present and future rights to this
# software under copyright law.
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
# EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
# MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
# IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY CLAIM, DAMAGES OR
# OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
# ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
# OTHER DEALINGS IN THE SOFTWARE.
#
# For more information, please refer to <http://unlicense.org/>
#
# This file is part of the Simba project.
#
##################################################################

esp01.name=ESP01

esp01.upload.tool=esptool
esp01.upload.speed=115200
esp01.upload.resetmethod=ck
esp01.upload.maximum_size=434160
esp01.upload.maximum_data_size=81920
esp01.upload.wait_for_upload_port=true
esp01.serial.disableDTR=true
esp01.serial.disableRTS=true

esp01.build.mcu=esp8266
esp01.build.f_cpu=80000000L
esp01.build.board=ESP01
esp01.build.variant=esp01
esp01.build.core=Simba:simba
esp01.build.ldscript=simba.flash.1m.ld
esp01.build.flash_size=512K
esp01.build.flash_mode=dio
esp01.build.flash_freq=40

esp01.compiler.c.extra_flags={esp01_compiler_c_extra_flags}
esp01.compiler.cpp.extra_flags={esp01_compiler_cxx_extra_flags}
esp01.compiler.c.elf.extra_flags={esp01_compiler_c_elf_extra_flags}
esp01.compiler.c.elf.libs={esp01_compiler_c_elf_libs}

##################################################################

esp12e.name=ESP12E

esp12e.upload.tool=esptool
esp12e.upload.speed=115200
esp12e.upload.resetmethod=ck
esp12e.upload.maximum_size=1044464
esp12e.upload.maximum_data_size=81920
esp12e.upload.wait_for_upload_port=true
esp12e.serial.disableDTR=true
esp12e.serial.disableRTS=true

esp12e.build.mcu=esp8266
esp12e.build.f_cpu=80000000L
esp12e.build.board=ESP12E
esp12e.build.variant=esp12e
esp12e.build.core=Simba:simba
esp12e.build.flash_size=4M
esp12e.build.flash_mode=dio
esp12e.build.flash_freq=40

esp12e.compiler.c.extra_flags={esp12e_compiler_c_extra_flags}
esp12e.compiler.cpp.extra_flags={esp12e_compiler_cxx_extra_flags}
esp12e.compiler.c.elf.extra_flags={esp12e_compiler_c_elf_extra_flags}
esp12e.compiler.c.elf.libs={esp12e_compiler_c_elf_libs}

##################################################################

nodemcu.name=NodeMCU

nodemcu.upload.tool=esptool
nodemcu.upload.speed=115200
nodemcu.upload.resetmethod=nodemcu
nodemcu.upload.maximum_size=1044464
nodemcu.upload.maximum_data_size=81920
nodemcu.upload.wait_for_upload_port=true
nodemcu.serial.disableDTR=true
nodemcu.serial.disableRTS=true

nodemcu.build.mcu=esp8266
nodemcu.build.f_cpu=80000000L
nodemcu.build.board=NodeMCU
nodemcu.build.variant=nodemcu
nodemcu.build.core=Simba:simba
nodemcu.build.flash_size=4M
nodemcu.build.flash_mode=qio
nodemcu.build.flash_freq=40

nodemcu.compiler.c.extra_flags={nodemcu_compiler_c_extra_flags}
nodemcu.compiler.cpp.extra_flags={nodemcu_compiler_cxx_extra_flags}
nodemcu.compiler.c.elf.extra_flags={nodemcu_compiler_c_elf_extra_flags}
nodemcu.compiler.c.elf.libs={nodemcu_compiler_c_elf_libs}

##################################################################
